Documents/УстановкаЦенМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦенМатериалов</Name>
			<Comment>Установка цен материалов (для расчета стоимости потолка)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПараметровПродукции</xr:Item>
				<xr:Item>InformationRegister.ЦеныМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьНулевыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСФотопечатьюОтличается</Name>
					<Comment>#12615</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСтоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСФотопечатью</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрПродукции</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/УстановкаЦенКлиент/Ext/Module.bsl
#Область УстановкаЦенОбщее

Процедура ДеревоВидовЦенУстанавливатьПриИзменении(Дерево, СтрокаДерева, ТаблицаВидовЦен=Неопределено) Экспорт
	
	Если НЕ СтрокаДерева.ЭтоГруппа Тогда
		// отметим в таблице цен
		Если НЕ ТаблицаВидовЦен=Неопределено Тогда
			НайденныеСтроки = ТаблицаВидовЦен.НайтиСтроки(Новый Структура("ВидЦены", СтрокаДерева.ВидЦены));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Устанавливать = СтрокаДерева.Устанавливать;
			КонецЕсли;
		КонецЕсли;
	Иначе	
		// если выделена группа, то выделим незапрещенные подчиненные элементы
		ИзменитьПризнакУстанавливатьРекурсивно(СтрокаДерева.ПолучитьЭлементы(), СтрокаДерева.Устанавливать, ТаблицаВидовЦен);
	КонецЕсли;
	
	ИзменитьПризнакУстанавливатьДляГрупп(Дерево);	
		
КонецПроцедуры

Процедура ДеревоВидовЦенИзменитьПризнакУстанавливать(Дерево, ПризнакУстанавливать, ТаблицаВидовЦен=Неопределено) Экспорт

	ИзменитьПризнакУстанавливатьРекурсивно(Дерево.ПолучитьЭлементы(), ПризнакУстанавливать, ТаблицаВидовЦен);
	
	ИзменитьПризнакУстанавливатьДляГрупп(Дерево);
	
КонецПроцедуры

// есть схожая процедура в УстановкаЦенСервер
Процедура ИзменитьПризнакУстанавливатьДляГрупп(Дерево) 
	
	// проверим необходимость установки галки на родительские группы
	// 1. получим все группы, начиная с "нижних"
	МассивГрупп = Новый Массив;
	НайтиГруппыРекурсивно(Дерево.ПолучитьЭлементы(), МассивГрупп);
	
	Для каждого ЭлементДерева из Дерево.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ЭтоГруппа Тогда
			МассивГрупп.Вставить(0, ЭлементДерева);
			НайтиГруппыРекурсивно(Дерево.ПолучитьЭлементы(), МассивГрупп);
		КонецЕсли;
	КонецЦикла;
	
	// 2. проверим галки каждой группы
	Для каждого ЭлементГруппа из МассивГрупп Цикл
		ВсеУстановлены = Истина;
		Для каждого ЭлементДерева из ЭлементГруппа.ПолучитьЭлементы() Цикл
			Если НЕ ЭлементДерева.Устанавливать Тогда
				ВсеУстановлены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ЭлементГруппа.Устанавливать = ВсеУстановлены;
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиГруппыРекурсивно(ЭлементыДерева, МассивГрупп)
	
	Для каждого ЭлементДерева из ЭлементыДерева Цикл
		Если ЭлементДерева.ЭтоГруппа Тогда
			МассивГрупп.Вставить(0, ЭлементДерева);
			НайтиГруппыРекурсивно(ЭлементДерева.ПолучитьЭлементы(), МассивГрупп);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура НайтиВыбранныеВидыЦенРекурсивно(Дерево, МассивЭлементов) Экспорт
	
	Для каждого ЭлементДерева из Дерево.ПолучитьЭлементы() Цикл
		Если НЕ ЭлементДерева.ЭтоГруппа И ЭлементДерева.Устанавливать Тогда
			МассивЭлементов.Добавить(ЭлементДерева.ВидЦены);
		КонецЕсли;
		Если ЭлементДерева.ЭтоГруппа Тогда
			НайтиВыбранныеВидыЦенРекурсивно(ЭлементДерева, МассивЭлементов);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

// изменяет признак для нижестоящих видов цен
Процедура ИзменитьПризнакУстанавливатьРекурсивно(ЭлементыДерева, ПризнакУстанавливать, ТаблицаВидовЦен) Экспорт
	
	Для каждого ЭлементДерева из ЭлементыДерева Цикл
		Если НЕ ЭлементДерева.Запрещенный Тогда
			ЭлементДерева.Устанавливать = ПризнакУстанавливать;
			Если НЕ ТаблицаВидовЦен=Неопределено Тогда
				НайденныеСтроки = ТаблицаВидовЦен.НайтиСтроки(Новый Структура("ВидЦены", ЭлементДерева.ВидЦены));
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденныеСтроки[0].Устанавливать = ПризнакУстанавливать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ИзменитьПризнакУстанавливатьРекурсивно(ЭлементДерева.ПолучитьЭлементы(), ПризнакУстанавливать, ТаблицаВидовЦен);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПризнакУстанавливатьДляГруппРекурсивно(ЭлементыДерева)
	
	Для каждого СтрокаДерева из ЭлементыДерева Цикл
		Если СтрокаДерева.ЭтоГруппа Тогда
			ПризнакУстанавливатьДляГруппРекурсивно(СтрокаДерева.ПолучитьЭлементы());
			
			ПризнакУстанавливать = Истина;
			Для каждого СтрокаГруппы из СтрокаДерева.ПолучитьЭлементы() Цикл
				Если НЕ СтрокаГруппы.Устанавливать Тогда	
			    	ПризнакУстанавливать = Ложь;
				КонецЕсли;
			КонецЦикла;
			СтрокаДерева.Устанавливать = ПризнакУстанавливать;			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьДоступностьСдвигаВидаЦены(ДеревоВидовЦен, ЭлементДеревоВидовЦен, ТаблицаВидыЦен = Неопределено, Направление = Неопределено) Экспорт
	
	СтруктураРезультата = Новый Структура("Вверх, Вниз", Ложь, Ложь);	
	
	ТекущиеДанные = ЭлементДеревоВидовЦен.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат СтруктураРезультата;	
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	РодительТД = ТекущиеДанные.ПолучитьРодителя();
	Если НЕ РодительТД = Неопределено Тогда
		СтрокиДерева = РодительТД.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = ДеревоВидовЦен.ПолучитьЭлементы();
	КонецЕсли;
	
	ТекИндекс = СтрокиДерева.Индекс(ТекущиеДанные);
	
	НовыйИндексВверх = ТекИндекс - 1;
	НовыйИндексВниз  = ТекИндекс + 1;
	КоличествоЭлементов = СтрокиДерева.Количество();
	
	СтруктураРезультата.Вверх = Истина; 
	СтруктураРезультата.Вниз = Истина;
	
	Если НовыйИндексВверх < 0 Тогда
		// элемент первый в коллекции
		СтруктураРезультата.Вверх = Ложь;		
	КонецЕсли;
	
	Если НовыйИндексВниз >= КоличествоЭлементов Тогда
		// элемент последний в коллекции
		СтруктураРезультата.Вниз = Ложь;
	КонецЕсли;
	
	Если СтруктураРезультата.Вверх Тогда
		ЗаменяемаяСтрока = СтрокиДерева.Получить(НовыйИндексВверх);
		Если ЗаменяемаяСтрока.ЭтоГруппа Тогда
			СтруктураРезультата.Вверх = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// сдвиг при необходимости
	Если (Направление = -1 И СтруктураРезультата.Вверх) 
		ИЛИ (Направление = 1 И СтруктураРезультата.Вниз) Тогда
		
		СтрокиДерева.Сдвинуть(ТекИндекс, Направление);
		
		// таблица, по которой строятся колонки в дереве номенклатуры
		НайденныеВидыЦен = ТаблицаВидыЦен.НайтиСтроки(Новый Структура("ВидЦены", ТекущиеДанные.ВидЦены));
		ТаблицаВидыЦен.Сдвинуть(ТаблицаВидыЦен.Индекс(НайденныеВидыЦен[0]), Направление);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецОбласти 

#Область УстановкаЦенНоменклатуры

Процедура РазвернутьДерево(Элементы, Дерево, ИмяЭлементаФормы = "ДеревоЦен") Экспорт
	
	КоллекцияЭлементовДерева = Дерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл       
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();     
		Элементы[ИмяЭлементаФормы].Развернуть(ИдентификаторСтроки, Истина);      
	КонецЦикла;
	
КонецПроцедуры

Процедура СвернутьДерево(Элементы, Дерево, ИмяЭлементаФормы = "ДеревоЦен") Экспорт
	
	КоллекцияЭлементовДерева = Дерево.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл       
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();      
		Элементы[ИмяЭлементаФормы].Свернуть(ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОткрытьФормуПодбораНоменклатуры(ПараметрыПодбора, Форма, УникальныйИдентификатор) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, Форма, УникальныйИдентификатор);
	
КонецПроцедуры

//Процедура УстановитьОбщуюЦенуНаНоменклатуру(Форма, ИмяОповещенияУстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены) Экспорт
//	
//	Если Форма.ДеревоЦен.ПолучитьЭлементы().Количество() = 0 Тогда 
//		Сообщить("Таблица цен пуста, расчет цен не будет выполнен");
//		Возврат;
//	КонецЕсли;
//	
//	ТекстВопроса = "Установить общую цену для всех позиций номенклатуры?";
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("Форма", Форма);
//	ДополнительныеПараметры.Вставить("ДеревоЦен", Форма.ДеревоЦен);
//	ДополнительныеПараметры.Вставить("ИмяОповещенияУстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены", ИмяОповещенияУстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены);

//	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("УстановитьОбщуюЦенуНаНоменклатуруФрагмент", ЭтотОбъект, ДополнительныеПараметры);
//	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
//	
//КонецПроцедуры

//Процедура УстановитьОбщуюЦенуНаНоменклатуруФрагмент(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
//        Возврат;
//    КонецЕсли;

//	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения(ДополнительныеПараметры.ИмяОповещенияУстановитьОбщуюЦенуНаНоменклатуруПослеВыбораЦены, ДополнительныеПараметры.Форма, ДополнительныеПараметры);
//	ПоказатьВводЧисла(ОписаниеОповещенияВыборЦены, 0, "Введите цену", 15, 2);

//КонецПроцедуры

#КонецОбласти

#Область УстановкаЦенНаПродукцию

Процедура ОткрытьФормуПодбораФактуры(ПараметрыПодбора, Форма, УникальныйИдентификатор) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораФактуры", ПараметрыПодбора, Форма, УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ОткрытьФормуПодбораШаблонов(ПараметрыПодбора, Форма, УникальныйИдентификатор) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораШаблоновПродукции", ПараметрыПодбора, Форма, УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоСправочникуФактур(Форма, ТабличнаяЧасть, ДополнительныеПараметрыЗаполнения = Неопределено) Экспорт
	
	ТекстВопроса = "Заполнить всеми элементами из справочника фактур?";
	ТребуетсяОчистка = ТабличнаяЧасть.Количество() > 0;
	
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено И ДополнительныеПараметрыЗаполнения.Свойство("КлючСвязи") Тогда
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСвязи", ДополнительныеПараметрыЗаполнения.КлючСвязи)); 
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТребуетсяОчистка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяОчистка Тогда
		ТекстВопроса = "Очистить таблицу и заполнить всеми элементами из справочника фактур?";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДополнительныеПараметрыЗаполнения", Неопределено);
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено Тогда
		ДополнительныеПараметры.Вставить("ДополнительныеПараметрыЗаполнения", ДополнительныеПараметрыЗаполнения);	
	КонецЕсли;
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоСправочникуФактурЗавершение", Форма, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоСправочникуШаблонов(Форма, ТабличнаяЧасть, ДополнительныеПараметрыЗаполнения = Неопределено) Экспорт
	
	ТекстВопроса = "Заполнить элементами из справочника шаблонов по виду продукции?";
	ТребуетсяОчистка = ТабличнаяЧасть.Количество() > 0;
	
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено И ДополнительныеПараметрыЗаполнения.Свойство("КлючСвязи") Тогда
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСвязи", ДополнительныеПараметрыЗаполнения.КлючСвязи)); 
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТребуетсяОчистка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяОчистка Тогда
		ТекстВопроса = "Очистить таблицу и заполнить элементами из справочника шаблонов по виду продукции?";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДополнительныеПараметрыЗаполнения", Неопределено);
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено Тогда
		ДополнительныеПараметры.Вставить("ДополнительныеПараметрыЗаполнения", ДополнительныеПараметрыЗаполнения);	
	КонецЕсли;
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоСправочникуШаблоновЗавершение", Форма, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоГруппеФактур(Форма, ТабличнаяЧасть, ДополнительныеПараметрыЗаполнения = Неопределено) Экспорт
	
	ТекстВопроса = "Заполнить элементами из справочника фактур по выбранной группе?";
	ТребуетсяОчистка = ТабличнаяЧасть.Количество() > 0;
	
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено И ДополнительныеПараметрыЗаполнения.Свойство("КлючСвязи") Тогда
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСвязи", ДополнительныеПараметрыЗаполнения.КлючСвязи)); 
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТребуетсяОчистка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяОчистка Тогда
		ТекстВопроса = "Очистить таблицу и заполнить элементами из справочника фактур по выбранной группе?";
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("Форма, ДополнительныеПараметрыЗаполнения", Форма, Неопределено);
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено Тогда
		ДополнительныеПараметры.Вставить("ДополнительныеПараметрыЗаполнения", ДополнительныеПараметрыЗаполнения);	
	КонецЕсли;
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоГруппеФактурФрагмент", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоГруппеФактурФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

	ОписаниеОповещенияВыборГруппы = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоГруппеФактурПослеВыбораГруппы", ДополнительныеПараметры.Форма, ДополнительныеПараметры.ДополнительныеПараметрыЗаполнения);
	ОткрытьФорму("Справочник.Фактура.ФормаВыбораГруппы",,,,,,ОписаниеОповещенияВыборГруппы);

КонецПроцедуры

Процедура ЗаполнитьМатериалыПоГруппеШаблонов(Форма, ТабличнаяЧасть, ДополнительныеПараметрыЗаполнения = Неопределено) Экспорт
	
	ТекстВопроса = "Заполнить элементами из справочника шаблонов по выбранной группе?";
	ТребуетсяОчистка = ТабличнаяЧасть.Количество() > 0;
	
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено И ДополнительныеПараметрыЗаполнения.Свойство("КлючСвязи") Тогда
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСвязи", ДополнительныеПараметрыЗаполнения.КлючСвязи)); 
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТребуетсяОчистка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяОчистка Тогда
		ТекстВопроса = "Очистить таблицу и заполнить элементами из справочника шаблонов по выбранной группе?";
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("Форма, ДополнительныеПараметрыЗаполнения", Форма, Неопределено);
	Если НЕ ДополнительныеПараметрыЗаполнения = Неопределено Тогда
		ДополнительныеПараметры.Вставить("ДополнительныеПараметрыЗаполнения", ДополнительныеПараметрыЗаполнения);	
	КонецЕсли;
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоГруппеШаблоновФрагмент", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоГруппеШаблоновФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

	ОписаниеОповещенияВыборГруппы = Новый ОписаниеОповещения("ЗаполнитьМатериалыПоГруппеШаблоновПослеВыбораГруппы", ДополнительныеПараметры.Форма, ДополнительныеПараметры.ДополнительныеПараметрыЗаполнения);
	ОткрытьФорму("Справочник.ШаблоныПродукции.ФормаВыбораГруппы",,,,,,ОписаниеОповещенияВыборГруппы);

КонецПроцедуры

Процедура УстановитьОбщуюЦенуНаМатериалы(ТабличнаяЧасть, ОтборСтрок = Неопределено, ТекстВопроса = "", УстанавливатьЦену = Истина, УстанавливатьЦенуФП = Истина, ВидЦены = Неопределено) Экспорт
	
	//ТекстВопроса = ?(ПустаяСтрока(ТекстВопроса), "Установить общую цену на все фактуры и цвета?", ТекстВопроса);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("ОтборСтрок", ОтборСтрок);
	ДополнительныеПараметры.Вставить("УстанавливатьЦену", УстанавливатьЦену);
	ДополнительныеПараметры.Вставить("УстанавливатьЦенуФП", УстанавливатьЦенуФП);
	ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены);

	//ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("УстановитьОбщуюЦенуНаМатериалыФрагмент", ЭтотОбъект, ДополнительныеПараметры);
	//ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	
	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("УстановитьОбщуюЦенуНаМатериалыФрагментПослеВыбораЦены", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводЧисла(ОписаниеОповещенияВыборЦены, 0, "Установить общую цену на все фактуры и цвета", 15, 2);
	
КонецПроцедуры

//Процедура УстановитьОбщуюЦенуНаМатериалыФрагмент(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
//        Возврат;
//    КонецЕсли;

//	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("УстановитьОбщуюЦенуНаМатериалыФрагментПослеВыбораЦены", ЭтотОбъект, ДополнительныеПараметры);
//	ПоказатьВводЧисла(ОписаниеОповещенияВыборЦены, 0, "Введите цену", 15, 2);

//КонецПроцедуры

Процедура УстановитьОбщуюЦенуНаМатериалыФрагментПослеВыбораЦены(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияДанных = ДополнительныеПараметры.ТабличнаяЧасть;
	Если НЕ ДополнительныеПараметры.ОтборСтрок = Неопределено Тогда
		КоллекцияДанных = ДополнительныеПараметры.ТабличнаяЧасть.НайтиСтроки(ДополнительныеПараметры.ОтборСтрок);
	КонецЕсли;
	
	ИмяКолонкиЦена = "Цена";
	ИмяКолонкиЦенаФото = "ЦенаСФотопечатью";
	Если НЕ ДополнительныеПараметры.ВидЦены = Неопределено Тогда
		Если ТипЗнч(ДополнительныеПараметры.ВидЦены) = Тип("СправочникСсылка.ВидыЦен") Тогда
			МассивВидовЦен = Новый Массив;
			МассивВидовЦен.Добавить(ДополнительныеПараметры.ВидЦены);
		Иначе
			МассивВидовЦен = ДополнительныеПараметры.ВидЦены;
		КонецЕсли;
		
		Для каждого ВидЦены из МассивВидовЦен Цикл		
			ИмяКолонкиЦена = УстановкаЦенВызовСервера.ИмяКолонкиПоВидуЦены(ВидЦены);
			ИмяКолонкиЦенаФото = ИмяКолонкиЦена + "Фото";
			Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
				ТекущаяСтрока[ИмяКолонкиЦена] 		= ?(ДополнительныеПараметры.УстанавливатьЦену,   ВыбранноеЗначение, ТекущаяСтрока[ИмяКолонкиЦена]);
				ТекущаяСтрока[ИмяКолонкиЦенаФото]   = ?(ДополнительныеПараметры.УстанавливатьЦенуФП, ВыбранноеЗначение, ТекущаяСтрока[ИмяКолонкиЦенаФото]);
			КонецЦикла;
		КонецЦикла;
		
	Иначе		
		Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
			ТекущаяСтрока[ИмяКолонкиЦена] 		= ?(ДополнительныеПараметры.УстанавливатьЦену,   ВыбранноеЗначение, ТекущаяСтрока[ИмяКолонкиЦена]);
			ТекущаяСтрока[ИмяКолонкиЦенаФото]   = ?(ДополнительныеПараметры.УстанавливатьЦенуФП, ВыбранноеЗначение, ТекущаяСтрока[ИмяКолонкиЦенаФото]);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьЦеныМатериаловНаПроцент(ТабличнаяЧасть, ОтборСтрок = Неопределено, ВидЦены = Неопределено, ТекстВопроса = "") Экспорт
	
	ТекстВопроса = ?(ПустаяСтрока(ТекстВопроса), "Изменить цены на процент на все фактуры и цвета?", ТекстВопроса);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("ОтборСтрок", ОтборСтрок);
	ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены);

	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ИзменитьЦеныМатериаловНаПроцентФрагмент", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

Процедура ИзменитьЦеныМатериаловНаПроцентФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("ИзменитьЦеныМатериаловНаПроцентПослеВыбораПроцента", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводЗначения(ОписаниеОповещенияВыборЦены, 0, "Введите процент");

КонецПроцедуры

Процедура ИзменитьЦеныМатериаловНаПроцентПослеВыбораПроцента(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияДанных = ДополнительныеПараметры.ТабличнаяЧасть;
	Если НЕ ДополнительныеПараметры.ОтборСтрок = Неопределено Тогда
		КоллекцияДанных = ДополнительныеПараметры.ТабличнаяЧасть.НайтиСтроки(ДополнительныеПараметры.ОтборСтрок);
	КонецЕсли;
	
	ИмяКолонкиЦена = "Цена";
	ИмяКолонкиЦенаФото = "ЦенаСФотопечатью";
	Если НЕ ДополнительныеПараметры.ВидЦены = Неопределено Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.ВидЦены) = Тип("СправочникСсылка.ВидыЦен") Тогда
			МассивВидовЦен = Новый Массив;
			МассивВидовЦен.Добавить(ДополнительныеПараметры.ВидЦены);
		Иначе
			МассивВидовЦен = ДополнительныеПараметры.ВидЦены;
		КонецЕсли;
		
		Для каждого ВидЦены из МассивВидовЦен Цикл		
			ИмяКолонкиЦена = УстановкаЦенВызовСервера.ИмяКолонкиПоВидуЦены(ВидЦены);
			ИмяКолонкиЦенаФото = ИмяКолонкиЦена + "Фото";
			Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
				ТекущаяСтрока[ИмяКолонкиЦена] 	  = ТекущаяСтрока[ИмяКолонкиЦена] * (1 + ВыбранноеЗначение / 100);
				ТекущаяСтрока[ИмяКолонкиЦенаФото] = ТекущаяСтрока[ИмяКолонкиЦенаФото] * (1 + ВыбранноеЗначение / 100);
			КонецЦикла;
		КонецЦикла;
		
	Иначе
	
		Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
			ТекущаяСтрока[ИмяКолонкиЦена] 	  = ТекущаяСтрока[ИмяКолонкиЦена] * (1 + ВыбранноеЗначение / 100);
			ТекущаяСтрока[ИмяКолонкиЦенаФото] = ТекущаяСтрока[ИмяКолонкиЦенаФото] * (1 + ВыбранноеЗначение / 100);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьЦеныМатериаловНаСумму(Форма, ТабличнаяЧасть, ОтборСтрок = Неопределено, 
										ВидЦены = Неопределено, ВидНоменклатуры = Неопределено, ЦенаСФотопечатьюОтличается = Ложь) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("ОтборСтрок", ОтборСтрок);
	ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены);
	ДополнительныеПараметры.Вставить("ВидНоменклатуры", ВидНоменклатуры);	

	ПараметрыФормыИзменения = Новый Структура;
	ПараметрыФормыИзменения.Вставить("ВидНоменклатуры", ВидНоменклатуры);
	ПараметрыФормыИзменения.Вставить("ЦенаСФотопечатьюОтличается", ЦенаСФотопечатьюОтличается);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьЦеныМатериаловНаСуммуЗавершение", ЭтотОбъект, ДополнительныеПараметры);	
	ОткрытьФорму("Документ.УстановкаЦенМатериалов.Форма.ФормаИзмененияЦены", ПараметрыФормыИзменения, Форма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

Процедура ИзменитьЦеныМатериаловНаСуммуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияДанных = ДополнительныеПараметры.ТабличнаяЧасть;
	Если НЕ ДополнительныеПараметры.ОтборСтрок = Неопределено Тогда
		КоллекцияДанных = ДополнительныеПараметры.ТабличнаяЧасть.НайтиСтроки(ДополнительныеПараметры.ОтборСтрок);
	КонецЕсли;
	
	ИмяКолонкиЦена = "Цена";
	ИмяКолонкиЦенаФото = "ЦенаСФотопечатью";
	//Если НЕ ДополнительныеПараметры.ВидЦены = Неопределено Тогда
	//	ИмяКолонкиЦена = УстановкаЦенВызовСервера.ИмяКолонкиПоВидуЦены(ДополнительныеПараметры.ВидЦены);
	//	ИмяКолонкиЦенаФото = ИмяКолонкиЦена + "Фото";
	//КонецЕсли;
	
	Если Результат.Свойство("ИзменитьНаСумму") И Результат.Свойство("ВидЦены") Тогда
		ИзменитьНаСумму  = Результат.ИзменитьНаСумму;
		ВидЦеныИзменения = Результат.ВидЦены;
		
		Если НЕ ДополнительныеПараметры.ВидЦены = Неопределено Тогда
			
			Если ТипЗнч(ДополнительныеПараметры.ВидЦены) = Тип("СправочникСсылка.ВидыЦен") Тогда
				МассивВидовЦен = Новый Массив;
				МассивВидовЦен.Добавить(ДополнительныеПараметры.ВидЦены);
			Иначе
				МассивВидовЦен = ДополнительныеПараметры.ВидЦены;
			КонецЕсли;
			
			Для каждого ВидЦены из МассивВидовЦен Цикл		
				ИмяКолонкиЦена = УстановкаЦенВызовСервера.ИмяКолонкиПоВидуЦены(ВидЦены);
				ИмяКолонкиЦенаФото = ИмяКолонкиЦена + "Фото";
				Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
					ТекущаяСтрока[ИмяКолонкиЦена] = ?(ВидЦеныИзменения = 1 ИЛИ ВидЦеныИзменения = 3, ТекущаяСтрока[ИмяКолонкиЦена] + ИзменитьНаСумму, ТекущаяСтрока[ИмяКолонкиЦена]);
					ТекущаяСтрока[ИмяКолонкиЦенаФото] = ?(ВидЦеныИзменения = 2 ИЛИ ВидЦеныИзменения = 3, ТекущаяСтрока[ИмяКолонкиЦенаФото] + ИзменитьНаСумму, ТекущаяСтрока[ИмяКолонкиЦенаФото]);
				КонецЦикла;				
			КонецЦикла;
		Иначе	
			
			Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
				ТекущаяСтрока[ИмяКолонкиЦена] = ?(ВидЦеныИзменения = 1 ИЛИ ВидЦеныИзменения = 3, ТекущаяСтрока[ИмяКолонкиЦена] + ИзменитьНаСумму, ТекущаяСтрока[ИмяКолонкиЦена]);
				ТекущаяСтрока[ИмяКолонкиЦенаФото] = ?(ВидЦеныИзменения = 2 ИЛИ ВидЦеныИзменения = 3, ТекущаяСтрока[ИмяКолонкиЦенаФото] + ИзменитьНаСумму, ТекущаяСтрока[ИмяКолонкиЦенаФото]);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
